Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/courts_system/supreme_court.html.txt.tmx
Source language: en
Languages: ga

source: Supreme Court of Ireland
ga: Cúirt Uachtarach na hÉireann

source: Article 34 of Bunreacht na hEireann (the Irish Constitution) sets down that the courts system in Ireland will include a Court of Final Appeal
ga: Leagann Airteagal 34 de Bunreacht na hEireann síos go mbeidh Cúirt Achomhairc Dheiridh mar chuid de chóras na gcúirteanna in Éirinn

source: This Court of Final Appeal is known in Ireland as the 'Supreme Court'
ga: Glaoitear ‘An Chúirt Uachtarach’ ar an gCúirt Achomhairc Dheiridh in Éirinn

source: The Supreme Court consists of the Chief Justice and 9 ordinary judges
ga: Is éard atá sa Chúirt Uachtarach ná an Príomhbhreitheamh agus 9 ngnáthbhreitheamh

source: This court is located in Dublin
ga: Tá an chúirt seo lonnaithe i mBaile Átha Cliath

source: Appeals are heard and determined by five judges unless the Chief Justice directs that any appeal or other matter (apart from matters relating to the Constitution) should be heard and determined by three judges
ga: Éistear le hachomhairc agus déanann cúig bhreitheamh cinneadh orthu ach amháin má dheireann an Príomhbhreitheamh gur cheart do thrí bhreitheamh éisteacht le haon achomharc ar leith nó aon chás eile (ach amháin cásanna a bhaineann leis an mBunreacht)

source: The jurisdiction of the Supreme Court is as follows:
ga: Is é an dlínse an Chúirt Uachtarach mar seo a leanas:

source: • It hears appeals from the Court of Appeal if the Supreme Court is satisfied that:
ga: • Éisteann sí achomhairc ón gCúirt Achomhairc má tá an Chúirt Uachtarach sásta:

source: - the decision involves a matter of general public importance or
ga: - I gceist sa bhreith ábhar a bhfuil tábhacht phoiblí i gcoitinne nó

source: - in the interests of justice it is necessary that there be an appeal to the Supreme Court
ga: - Ar mhaithe leis an gceartas, is gá go mbeadh achomharc chuig an gCúirt Uachtarach Ard-Chúirt

source: • It hears direct appeals from the High Court if the Supreme Court is satisfied that there are exceptional circumstances warranting a direct appeal to it
ga: • Éisteann sí achomhairc díreach ón Ard-Chúirt má tá an Chúirt Uachtarach sásta go bhfuil imthosca eisceachtúla bhfuil gá achomharc díreach dó

source: The Supreme Court must be satisfied that:
ga: Ní mór an Chúirt Uachtarach a bheith sásta go:

source: - the decision involves a matter of general public importance and/or
ga: - Baineann an cinneadh ábhar a bhfuil tábhacht phoiblí i gcoitinne agus / nó

source: - it is in the interests of justice
ga: - Go bhfuil sé ar mhaithe leis an gceartas

source: • It has the power to decide if a question of the permanent incapacity of the President arises
ga: • Tá an chumhacht ag an gCúirt Uachtarach cinneadh a dhéanamh má thagann ceist aníos maidir le buan-mhíchumais an Uachtaráin aníos

source: • It has the power to decide whether a Bill that has been passed by both Houses of the Oireachtas and presented to the President of Ireland for his/her signature before being enacted into law is repugnant to the Constitution
ga: • Tá an chumhacht ag an gCúirt Uachtarach cinneadh a dhéanamh má tá Bille atá tar éis a bheith pasáilte ag an dá Theach den Oireachtas agus curtha faoi bhráid an Uachtaráin dá s(h)íniú colach don Bhunreacht nó nach bhfuil sula n-achtaítear é

source: This happens when the matter is referred to the Supreme Court by the President
ga: Tarlaíonn sé seo nuair a chuireann an tUachtarán an cheist ar aghaidh chuig an gCúirt Uachtarach

source: In a case where a proposed Bill has been referred to the Supreme Court it is heard before seven judges
ga: Sa chás go bhfuil bille molta tar éis a bheith curtha faoi bhráid na Chúirte Uachtaraí, éisteann seacht mbreitheamh leis

source: A barrister represents the Office of the Attorney General, arguing the Bill is constitutional and should remain as it is
ga: Seasann abhcóide d'Oifig an Ard-Aighne, ag argóint go bhfuil an Bille bunreachtúil agus gur cheart dó fanacht mar atá sé

source: The Court appoints another barrister to set out the reasons why the Bill is unconstitutional and should not be enacted
ga: Ceapann an Chúirt abhcóide eile chun na fáthanna nach bhfuil an Bille bunreachtúil a leagadh amach chomh maith leis na fáthanna nár cheart é a achtú

source: In cases examining whether or not a Bill is constitutional, the Supreme Court makes one decision and this decision is final
ga: I gcásanna a dhéanann scrúdú ar an gceist faoi bhunreachtúlacht Bille, déanann an Chúirt Uachtarach cinneadh amháin agus tá an cinneadh seo críochnaitheach

source: If the Court finds the Bill is contrary or repugnant to the Constitution, it cannot be enacted into law in its present form
ga: Má dheireann an Chúirt go bhfuil an Bille i gcoinne nó colach don Bhunreacht, ní féidir é a achtú mar atá sé

source: Further information on the Supreme Court is available at supremecourt.ie
ga: Tá tuilleadh eolais ar an gCúirt Uachtarach ar fáil ag supremecourt.ie
